ROR-backend/app/controllers/albums_controller.rb

SELECT `albums`.* FROM `albums`
---
  def index
    @albums = Album.all

INSERT INTO `albums` (`title`, `performer`, `cost`, `created_at`, `updated_at`) VALUES ('Most Requested Hits', 'Aaron Carter', '28', '2020-03-05 09:50:34', '2020-03-05 09:50:34')
---
  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save

UPDATE `albums` SET `title` = 'Greatest Songs', `updated_at` = '2020-03-05 10:07:33' WHERE `albums`.`id` = 1
---
  def update
    respond_to do |format|
      if @album.update(album_params)

SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1
---
    def set_album
      @album = Album.find(params[:id])